#+SETUPFILE: theme-readtheorg.setup
#+Title: Git from the Ground up
#+AUTHOR: Levin
#+PROPERTY: header-args :dir ~/Projects/Code/learnings/org/tmp


* Introduction
We're going to learn a little something about the git data model by crafting the .git directory and blob by hand. it'll be fun!

* Heading 1
*bold*

* Heading 2
/Italics/

* Heading 3
=monospace=


* where are we and is git happy?
lets start by seeing we are and if we're in a valid git repo

#+BEGIN_src shell
  echo "My current working dir is: $(dirs +0)"
  ls -l
  tree .
#+end_src

#+RESULTS:
| My    | current      | working | dir   | is: |
| total | 0            |         |       |     |
| .     |              |         |       |     |
|       |              |         |       |     |
| 0     | directories, |       0 | files |     |

* test
